# ==========================================
# BaleBet - Configuration
# ==========================================

BOT_TOKEN = "توکن_جدید_بات_اینجا"

ADMIN_ID = 595450272

DATABASE_PATH = "data/bot.db"


# ==========================================
# ارزش ژتون
# ==========================================

TOKEN_VALUE = 10


# ==========================================
# دعوت دوستان
# ==========================================

REFERRER_REWARD = 2
REFERRED_REWARD = 1


# ==========================================
# چرخونه
# ==========================================

SPIN_COST = 10

SPIN_REWARDS = [
    {
        "name": "❌ پوچ",
        "reward": 0,
        "chance": 30
    },
    {
        "name": "❌ پوچ",
        "reward": 0,
        "chance": 25
    },
    {
        "name": "❌ پوچ",
        "reward": 0,
        "chance": 20
    },
    {
        "name": "🪙 ۵ ژتون",
        "reward": 5,
        "chance": 12
    },
    {
        "name": "💰 ۱۰ ژتون",
        "reward": 10,
        "chance": 7
    },
    {
        "name": "💎 ۲۰ ژتون",
        "reward": 20,
        "chance": 5
    },
    {
        "name": "🏆 ۵۰ ژتون",
        "reward": 50,
        "chance": 1
    }
]
